/*
  В този пример измерената стойност от температурния сензор (MCP9701)
  се показва на серийния монитор (Tools -> Serial Monitor).
  
  Температурният сензор (TMP) e свързан към пин D35.
*/

// константи, описващи използваните пинове
const int TMP_pin = 35;

// променливи, използвани при четенето на сензора
int TMP_value;
float DegC;

void setup() {
  // настройване на серийната комуникация
  // Забележка: в серийният монитор трябва да бъда избрана същата скорост
  Serial.begin(115200);
}

void loop() {  
  // прочитане на стойността на температурния сензор (между 0 и 4095):
  TMP_value = analogRead(TMP_pin);

  // преобразуване на прочетената стойност в целзиеви градуси
  DegC = ((((float)TMP_value * 3.3) / 4096.0) - 0.400) / .0195;
  
  // показване на стойностите на серийния монитор
  Serial.print("TMP= ");
  Serial.print(TMP_value);
  Serial.print("\t\t");

  Serial.print("DEG= ");
  Serial.print(DegC);
  Serial.println("\t\t");

  delay(100);
}
